Renova/src/AccumulationRegisters/РемонтыИПродукция/РемонтыИПродукция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РемонтыИПродукция</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаИтого</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаЗаРаботы</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаЗаДетали</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаЗаВыезд</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МодельПродукции</name>
    <type>
      <types>CatalogRef.МоделиПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодНеисправности</name>
    <type>
      <types>CatalogRef.КодыНеисправностей</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Renova/src/AccumulationRegisters/КонтрагентыИДата/КонтрагентыИДата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КонтрагентыИДата</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаИтого</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаЗаРаботы</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаЗаДетали</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаЗаВыезд</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СервисныйЦентр</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПокупки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СрокВЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Renova/src/AccumulationRegisters/ФабрикиИСмены/ФабрикиИСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ФабрикиИСмены</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаИтого</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаЗаРаботы</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаЗаДетали</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаЗаВыезд</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Фабрика</name>
    <type>
      <types>CatalogRef.ФабрикиИСмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.ФабрикиИСмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Renova/src/Catalogs/ГруппыМоделей/ГруппыМоделей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыМоделей</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ВидыПродукции</owners>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыПродукции</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МодельПродукции</name>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.МоделиПродукции</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Renova/src/CommonModules/ИсточникДанныхСКД/Module.bsl
Функция ДанныеОтчета(ДатаНачала, ДатаОкончания) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "

	|ВЫБРАТЬ
	|	Ремонты.Период КАК Период,
	|	Ремонты.Регистратор КАК Регистратор,
	|	Ремонты.НомерСтроки КАК НомерСтроки,
	|	Ремонты.ВидПродукции КАК ВидПродукции,
	|	Ремонты.МодельПродукции КАК МодельПродукции,
	|	Ремонты.КодНеисправности КАК КодНеисправности,
	|	Ремонты.СуммаИтого КАК СуммаИтого,
	|	Ремонты.Количество КАК Количество,
	|	Контрагенты.СервисныйЦентр КАК СервисныйЦентр,
	|	Контрагенты.СрокВЭксплуатации КАК СрокВЭксплуатации,
	|	Фабрики.Фабрика КАК Фабрика,
	|	Фабрики.Смена КАК Смена,
	|	ГруппыМоделей.Ссылка КАК ГруппыМоделей
	|ИЗ
	|	РегистрНакопления.РемонтыИПродукция КАК Ремонты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.КонтрагентыИДата КАК Контрагенты
	|	ПО Ремонты.Регистратор = Контрагенты.Регистратор
	|		И Ремонты.НомерСтроки = Контрагенты.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ФабрикиИСмены КАК Фабрики
	|	ПО Ремонты.Регистратор = Фабрики.Регистратор
	|		И Ремонты.НомерСтроки = Фабрики.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыМоделей КАК ГруппыМоделей
	|	ПО Ремонты.МодельПродукции = ГруппыМоделей.МодельПродукции.Модель
	|ГДЕ
		|Ремонты.Период МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции
